касса_Вегас/src/Enums/ТипыОплаты/ТипыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОплаты</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>ВстречноеПредоставление</name>
  </enumValues>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
  </enumValues>
  <enumValues>
    <name>Постоплата</name>
  </enumValues>
  <enumValues>
    <name>Предоплата</name>
  </enumValues>
</mdclass:Enum>

касса_Вегас/src/Catalogs/ПодключаемоеОборудование/ПодключаемоеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодключаемоеОборудование</name>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторУстройства</name>
    <comment>Уникальный идентификатор устройства стандарта оборудования</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УстройствоИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДрайверОборудования</name>
    <type>
      <types>CatalogRef.ДрайверыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПакетнаяПечать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Параметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
</mdclass:Catalog>

касса_Вегас/src/CommonModules/ПодключаемоеОборудование/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОпределитьПодключаемоеОборудование(Драйвер, ПодключаемоеОборудование) Экспорт
	
	ПодключаемоеОборудование = Справочники.ПодключаемоеОборудование.ПустаяСсылка();
	
	Если НЕ ЗначениеЗаполнено(Драйвер) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПодключаемоеОборудование.Ссылка
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.ДрайверОборудования = &ДрайверОборудования";
	
	Запрос.УстановитьПараметр("ДрайверОборудования", Драйвер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ПодключаемоеОборудование = Выборка.Ссылка;
		
		Если НЕ ПодключаемоеОборудование.УстройствоИспользуется Тогда
			ПодключаемоеОборудованиеОбъект = ПодключаемоеОборудование.ПолучитьОбъект();
			ПодключаемоеОборудованиеОбъект.УстройствоИспользуется = Истина;
			ПодключаемоеОборудованиеОбъект.Записать();
		КонецЕсли;
		
	Иначе
		
		РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
		
		ПодключаемоеОборудованиеОбъект = Справочники.ПодключаемоеОборудование.СоздатьЭлемент();
		
		ПодключаемоеОборудованиеОбъект.ТипОборудования        = Драйвер.ТипОборудования;
		ПодключаемоеОборудованиеОбъект.ДрайверОборудования    = Драйвер;
		ПодключаемоеОборудованиеОбъект.Наименование           = Драйвер.Наименование;
		ПодключаемоеОборудованиеОбъект.УстройствоИспользуется = Истина;
		ПодключаемоеОборудованиеОбъект.РабочееМесто           = РабочееМесто;
		ПодключаемоеОборудованиеОбъект.Записать();
		
		ПодключаемоеОборудование = ПодключаемоеОборудованиеОбъект.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТипОплатыККТ(ТипОплаты) Экспорт
	
	Если ТипОплаты = Перечисления.ТипыОплаты.Наличные Тогда
		
		Возврат Перечисления.ТипыОплатыККТ.Наличные;
		
	ИначеЕсли ТипОплаты = Перечисления.ТипыОплаты.ПлатежнаяКарта Тогда
		
		Возврат Перечисления.ТипыОплатыККТ.Электронно;
		
	ИначеЕсли ТипОплаты = Перечисления.ТипыОплаты.ВстречноеПредоставление Тогда
		
		Возврат Перечисления.ТипыОплатыККТ.ВстречноеПредоставление;
		
	ИначеЕсли ТипОплаты = Перечисления.ТипыОплаты.Постоплата Тогда
		
		Возврат Перечисления.ТипыОплатыККТ.Постоплата;
		
	ИначеЕсли ТипОплаты = Перечисления.ТипыОплаты.Предоплата Тогда
		
		Возврат Перечисления.ТипыОплатыККТ.Предоплата;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
